package com.kpsoftwaresolutions.amadernatoreapp.adapters;

import java.util.ArrayList;
import java.util.HashMap;
import java.util.List;

/**
 * Created by zahid on 10/16/2017.
 */

public class ExpandableListDataPump {
    public static HashMap<String, List<String>> getData() {
        HashMap<String, List<String>> expandableListDetail = new HashMap<String, List<String>>();

        List<String> p1 = new ArrayList<String>();
        p1.add("তাঁর আসল নাম জানা যায় না। লোকে তাঁকে হযরত ঘাসী দেওয়ান বলেই জানে। তাঁর আস্তানা ছিল সিংড়া উপজেলার চলনবিল এলাকার তিসিখালীতে। তিনি ছিলেন হযরত বড়পীর আব্দুল কাদের জিলানী (রহঃ) এর অদেখা মুরীদ বা অনুসারী। প্রতি বছর চৈত্র মাসের পূর্ণিমা তিথিতে দাহিয়ার বিলে ঘাসী দেওয়ানের দরগাহে ওরস বা বার্ষিক মেলা অনুষ্ঠিত হয়।");

        List<String> p2 = new ArrayList<String>();
        p2.add("কুবীর চান শাহ্\u200C এই এলাকায় আসেন ধর্ম প্রচারের জন্য। ধর্ম প্রচারের পর তিনি এখানেই ইন্তেকাল করেন। নাটোর সদর উপজেলার বাবুর পুকুর পাড় একডালা নামক স্থানে তাঁর মাজার আছে");

        List<String> p3 = new ArrayList<String>();
        p3.add("দেওয়ান সাগর ধর্ম প্রচারের উদ্দেশ্যে এদেশে আগমন করেন। সদর উপজেলার দিঘাপাতিয়া ইউনিয়নের গোবিন্দপুর গ্রামে তাঁর মাজার বিদ্যামান।\n" +
                "\n" +
                " \n" +
                "\n" +
                "পূর্বে উল্লেখিত ব্যক্তিবর্গ ছাড়াও নাটোরের কৃতি সন্তানদের মধ্যে রয়েছেন কালী প্রসন্ন রায়, রামকান্ত রায়, রাণী হেমাঙ্গিনী দেবী, মোহিত কুমার মৈত্র, প্রমথ নাথ বিশী, গজেন্দ্রনাথ কর্মকার ও সমর পাল।");

        List<String> p4 = new ArrayList<String>();
        p4.add("জগদিন্দ্রনাথ রায় ছিলেন নাটোর বড় তরফের রাজা গোবিন্দনাথের স্ত্রী ব্রজসুন্দরীর দওক পুত্র। তার আসল নাম ব্রজনাথ। ১৮৬৮ খ্রীস্টাব্দের ২৬ শে অক্টোবর নাটোরের হরিশপুর নামক গ্রামে এক সম্ভান্ত গরীব হিন্দু পরিবারে তার জন্ম হয়। তাঁর পিতার নাম শীনাথ রায় এবং মাতার নাম প্রসন্নময়ী দেবী। এই কৃতি সন্তান কালক্রমে জ্ঞানী-গুনী রাজনীতিবিদ ও সমাজ সংগঠক হিসাবে নাটোর রাজপরিবারের ইতিহাসে স্থান করে নিয়েছিলেন। জগদিন্দ্রনাথ ১৮৮৯ সালের ৯ই অক্টোবর রাজকার্যভার গ্রহণ করেন। বৃটিশ ভারতে সাম্রাজ্যবাদ বিরোধী আন্দোলনে প্রগতিবাদী চেতনার ক্ষেত্রে তার অবদান ছিল। সাহিত্য ও সংস্কৃতির ক্ষেত্রে তার বিশেষ অবদান ছিল। তার রচিত উল্লেখ যোগ্য গ্রন্থগুলির মধ্যে ‘নূরজাহান’ ’সন্ধাতারা‘ প্রধান। মহারাজরা সাংবাদিকতা ও করতেন। তিনি মানসী নামক একটি পত্রিকার ও সম্পাদনা করতেন। এ ছাড়া তার রচিত অনুবাদ সাহিত্য, ভ্রমন কাহিনী, জীবনী গ্রন্থ, কবিতা, গান এবং রাজনৈতিক প্রবন্ধ সমুহ বাংলাদেশে এককালে বিপুল আলোড়ন এনেছিল। তিনি ছিলেন সমাজ সেবক, প্রজাবৎসল এবং সত্যিকারের দেশ হিতৈষী। দানের ক্ষেত্রে তিনি ছিলেন অগ্রনী। তার শ্রেষ্ঠ কীর্তি নাটোরের মহারাজা হাই স্কুল প্রতিষ্ঠা। ১৮৯৩ সালে নাটোর ত্যাগ করে কলিকাতায় স্থায়ীভাবে বসবাস শুরু করেন। ১৯২৫ খ্রীস্টাব্দের ২৬ শে ডিসেম্বর মোটর গাড়ীর ধাক্কায় গুরুতর আহত হন এবং ০৫ জানুয়ারী, ১৯২৬ খ্রীষ্টাব্দে তিনি ইহলোক ত্যাগ করেন।");

        List<String> p5 = new ArrayList<String>();
        p5.add("নাটোর রাজবংশের প্রথম রাজা ছিলেন রামজীবন। রামজীবনের পালিত পুত্রের নাম ছিল রামকান্ত। বগুড়া জেলার অন্তর্গত আদমদিঘী উপজেলার ছাতিয়ান গ্রাম নিবাসী আত্মারাম চৌধুরীর একমাত্র কন্যা ভবানীর সাথে রামকান্তের বিয়ে হয়। বিয়ের সময় ভবানীর বয়স ছিল ১৫ বছর। ১৭৩০ খ্রিস্টাব্দে রাজা রামজীবনের মৃত্যুর পূর্বে তিনি তাঁর দেওয়ান দয়ারামকে রামকান্তের অভিভাবক নিযুক্ত করেন। রামকান্ত রাজা হলেও প্রকৃতপক্ষে রাজকার্যাদি সম্পাদন করতেন দেওয়ান দয়ারাম। ১৭৪৮ খ্রিস্টাব্দে রাজা রামকান্ত পরলোক গমন করেন। স্বামীর মৃত্যুর পর আলীবর্দী খান রানী ভবানীর উপরই বিস্তৃত রাজশাহী চাকলার জমিদারী পরিচালনার ভার অর্পন করেন। তিনি অত্যন্ত যোগ্যতা ও নিষ্ঠার সাথে তার জমিদারী পরিচালনা করেছিলেন।\n" +
                "\n" +
                "শিক্ষা বিস্তারের ক্ষেত্রে তিনি উল্লেখযোগ্য ভূমিকা রাখেন। তাঁর দানকৃত অর্থে বহু টোল পরিচালিত হত। জনসাধারনের সুবিধার জন্য তিনি অনেক হাট, বাজার এবং রাস্তা-ঘাট নির্মাণ করেছেন এবং পানির কষ্ট নিবারনের জন্য বহু দীঘি ও পুকুর খনন করেছিলেন। ১৮০২ খ্রিস্টাব্দে ৭৯ বছর বয়সে বড়নগর রাজবাড়ীতে রাণী ভবানী মৃত্যুবরণ করেন।");

        List<String> p6 = new ArrayList<String>();
        p6.add("আহসান আলী ১৮৬৩ খ্রিস্টাব্দে নওগাঁ জেলার অন্তর্গত রাণীনগর উপজেলার লোহাচুড়া গ্রামে জন্মগ্রহণ করেন। তাঁর পূর্ণ নাম আহসান আলী খন্দকার। আধ্যাত্ব সাধনায় সিদ্ধি লাভ করে আহসান আলী সাধক পুরুষ বলে গণ্য হন। ৪৫ বছর বয়সে তিনি গুরু-প্রদত্ত খেলাফত লাভ করেন। ১৯১৫ খ্রিস্টাব্দে তিনি জেলার সিংড়া উপজেলাধীন বজরাহার গ্রামে স্থায়ীভাবে বসবাস শুরু করেন। আহসান আলীর বহুসংখ্যক তত্ত্ব সংগীত রচনায় লালন শাহ্ এবং পাঞ্জু শাহ্ এর প্রভাব যথেষ্ট কার্যকর ছিল। তিনি ১৯৩৩ খ্রিস্টাব্দে মৃত্যুবরণ করেন।");

        List<String> p7 = new ArrayList<String>();
        p7.add("১৮৭০ সালের ১০ ডিসেম্বর সিংড়া উপজেলার ছাতারদীঘি ইউনিয়নের কড়চমাড়িয়া গ্রামে যদুনাথ সরকার জন্মগ্রহণ করেন। তিনি ১৮৯১ সালে ইংরেজী সাহিত্য ও ইতিহাস বিষয়ে অনার্স নিয়ে বিএ পাশ করেন।\n" +
                "\n" +
                " \n" +
                "\n" +
                "১৮৯২ খ্রিটাব্দে তিনি ইংরেজীতে প্রথম শ্রেণীতে প্রথম স্থান অধিকার করে এম এ পাশ করেন। কলিকাতার রিপন কলেজে অধ্যাপনা পদে চাকুরী জীবন শুরু করে ১৯৩০ সালে তিনি চাকুরী থেকে অবসর নেন। অবসরের পূর্বে ৫ বছর তিনি কলিকাতা বিশ্ববিদ্যালয়ে উপাচার্য পদে আসীন ছিলেন। বৃটিশ সরকার তাঁকে ১৯২৬ সালে সি আই ই এবং ১৯২৯ সালে ‘নাইটহুড’ খোতাবে সম্মানিত করেন। ১৯৩৬ ও ১৯৪৪ সালে ঢাকা ও পাটনা বিশ্ববিদ্যালয় তাঁকে ডি. লিট উপাধি প্রদান করেন। ১৯৫৮ সালের ১৯ মে সোমবার তিনি মৃত্যুবরণ করেন।");

        List<String> p8 = new ArrayList<String>();
        p8.add("শরৎকুমার রায় ১৮৭৬ খ্রিটাব্দে দিঘাপতিয়া রাজপরিবারে জন্মগ্রহণ করেন। তাঁর পিতা ছিলেন রাজা প্রমথনাথ রায় বাহাদুর মাতা রাণী দ্রবময়ী। তিনি দয়ারামপুর এস্টেট-এ তিনশত বিঘা জমির উপরে একটি কৃষি খামার স্থাপন করেছিলেন যার নাম ‘রাণী দ্রবময়ী ফার্ম’। এ ফার্মে উৎপাদিত আখ মাড়াই করে চিনি উৎপাদিত হত। এ অঞ্চলে কোন চিনিকল না থাকায় ১৯৩৬ খিস্টাব্দে গোপালপুরে স্থাপিত হয় ‘নর্থ বেঙ্গল সুগার মিল’।\n" +
                "\n" +
                "‘বরেন্দ্র অনুসন্ধান সমিতি’ এবং ‘বরেন্দ্র মিউজিয়াম’ স্থাপন তাঁর জীবনের অক্ষয় কীর্তি। ১৯৪৬ খ্রিস্টাব্দের ১২ এপ্রিল তিনি ইহলোক ত্যাগ করেন।");

        List<String> p9 = new ArrayList<String>();
        p9.add("কবি হাসার উদ্দীনের জন্ম ১৯০৭ সালের ৮ই নভেম্বর কান্দিভিটুয়া গ্রামে। তিনি মহারাজা উচ্চ বিদ্যালয় হতে ১৯২৮ সালে মহসিন বৃত্তিসহ প্রথম বিভাগে ম্যাট্টিকুলেশন পাশ করেন। ১৯৬২ সন পর্যন্ত সরকারি চাকুরিজীবি ছিলেন। নাটোর থেকে প্রকাশিত সাপ্তাহিক \"বেঙ্গল প্রেসিডেন্সি গেজেট\" পত্রিকায় তাঁর প্রথম কবিতা ১৯২৩ সালে প্রকাশিত হয়। মাইকেল মধুসূদন দত্তের পর অমিত্রাক্ষর ছন্দে রচিত তাঁর মধুপ্রশস্তি কবিতা রচনার জন্য তিনি \"কবিরত্ন\"  উপাধি পান।  \n" +
                "\n" +
                "তাঁর রচিত উল্লেখযোগ্য গ্রন্থগুলি হলো সৌভাগ্য সোপান,গীতিনকশা,  মোড়লের বিচার,শুক্তিমালা,দ্বাদশী,হিজরত, মহোত্তম জীবন, সন্ধানে এবং তাঁর অপ্রকাশিত পান্ডুলিপির মধ্যে আছে হিলাল, বিষকুম্ভ, বেলুবন ইত্যাদি। তাঁর নিজ বাসভবন “দীন মঞ্জিল” বড়গাছা,নাটোরে তিনি ১৯৯৭ সালের ৩১ ডিসেম্বর ইন্তেকাল করেন।");

        List<String> p10 = new ArrayList<String>();
        p10.add("১৯০৭ সালে নাটোর জেলার সিংড়া উপজেলার স্থাপনদীঘি নামক গ্রামে মাদার বখশ জন্মগ্রহণ করেন। তাঁর পিতার নাম বলিউদ্দিন মন্ডল। ১৯২৮ সালে তিনি কলিকাতা বিশ্ববিদ্যালয় থেকে ইতিহাসে এম,এ পাশ করেন এবং ১৯২৯ সালে তিনি বি,এল ডিগ্রী অর্জন করেন। প্রথমে ২-৩ বছর শিক্ষকতা করবার পর ১৯৩৪ সালে তিনি রাজশাহী জজ কোর্টে আইন ব্যবসায় আত্মনিয়োগ করেন। পরবর্তী জীবনে তিনি আইন ব্যবসায়ে প্রচুর খ্যাতি ও সুনাম অর্জন করেছিলেন। ওকালতি ছাড়াও তিনি রাজনীতি ও সমাজ সেবায় জনপ্রিয় ব্যক্তিত্ব ছিলেন। ১৯৪৬ সালে তিনি বঙ্গীয় আইন সভার সদস্য নির্বাচিত হন।\n" +
                "\n" +
                "১৯৪৭ থেকে ১৯৫৪ সাল পর্যন্ত পাকিস্তান আইন সভার সদস্য হিসাবে জনগণের সেবা করতে সক্ষম হন। আইন সভার সদস্য থাকা সত্ত্বেও ১৯৫০ সালে তিনি রাজশাহী পৌরসভার চেয়ারম্যান নির্বাচিত হন। রাজশাহী বিশ্ববিদ্যালয়ের স্বাপ্নিক ও স্রষ্টা। নানা ঘাত-প্রতিঘাত, বাধা-বিপত্তিকে অতিক্রম করে মাদার বখশ এর বিশেষ প্রচেষ্টায় তদানিন্তন সরকার ১৯৫৩ সালের ৩১ মার্চ ‘ রাজশাহী বিশ্ববিদালয় এ্যাক্ট’ পাশ করে এবং তারপর যথারীতি কার্যক্রম শুরু করে এবং তা বাস্তবায়িত হয়। এই বিশ্ববিদ্যালয়ে আইন বিভাগ চালু হলে তিনি শিক্ষকরূপে যোগদান করেন এবং মৃত্যুর পূর্ব পর্যন্ত এই পদে বহাল ছিলেন। স্বাধীনতার পর তাঁর নামানুসারে রাজশাহী বিশ্ববিদ্যালয়ের একটি হলের নাম মাদার বখশ রাখা হয়েছে। ১৯৬৭ সালের ২০ জানুয়ারী দূরারোগ্য ক্যান্সার রোগে আক্রান্ত হয়ে তিনি মৃত্যু বরণ করেন।");

        List<String> p11 = new ArrayList<String>();
        p11.add("সিংড়া উপজেলার ছিলামপুর গ্রামে ১৯৫১ সালে তিনি জন্মগ্রহণ করেন। তিনি একজন প্রাবন্ধিক ও গবেষক। বর্তমানে তিনি রাজশাহী বিশ্ববিদ্যায়ের রাষ্ট্রবিজ্ঞান বিভাগের অধ্যাপক। তাঁর রচিত উল্লেখযোগ্য গ্রন্থগুলির মধ্যে বাংলাদেশের স্থানীয় স্বায়ত্বশাসন, নাটোরের মহারাণী ভবানী, রাষ্ট্রবিজ্ঞান তওব ও নীতিমালা ইত্যাদি উল্লেখযোগ্য।");

        List<String> p12 = new ArrayList<String>();
        p12.add("সাহিত্যিক রাধাচরণ চক্রবর্তী ১৩০১ বঙ্গাব্দে ৮ই চৈত্র চৌকিরপাড় গ্রামে জন্ম গ্রহণ করেন। তাঁর প্রকাশিত গ্রন্থগুলির মধ্যে আলেয়া, দীপা, তিলকধারী, পল্লব, বুকের ভাষা, চক্রপাক, বৈরাগীর চর, সাওন, হোয়াইট কেবিন, ঝড়, তপ ও তাপ, ঘর মোহানী, কো-এডিকেশন, মৃগয়া, ভাঙন ইত্যাদি অন্যতম। বাংলা ১৩৪৫ সনে তিনি মৃত্যুবরণ করেন।");

        List<String> p13 = new ArrayList<String>();
        p13.add("খাদেমুল বাসার ১৯৩৪ খ্রিষ্টাব্দের ২৮ মার্চ নাটোর জেলার সিংড়া উপজেলাধীন ছাতারবাড়ীয়া গ্রামে জন্মগ্রহণ করেন। তাঁর পিতার নাম হাসমতুল্লাহ শাহ্ এবং মাতার নাম মোছাঃ হাছিনা বেগম।\n" +
                "\n" +
                "খাদেমুল বাসার রাজশাহী কলেজ থেকে উচ্চ মাধ্যমিক পাশ করে ১৯৫৩ সালে বিমান বাহিনীতে যোগ দেন এবং বিমান বাহিনী  একাডেমী থেকে গ্রাজুয়েশান ডিগ্রী লাভ করেন। তিনি ক্যাডেট হিসাবে যোগদান করে ধীরে ধীরে পদোন্নতির মাধ্যমে ১৯৭০ সালে উইং কমান্ডার পদ লাভ করেন। স্বাধীনতা লাভের পর তিনি ৩ বার পদোন্নতি লাভ করেন এবং ১৯৭৬ সালের মে মাসে তিনি বাংলাদেশ বিমান বাহিনীর প্রধান নিযুক্ত হন এবং ঐ মাসেই তাঁকে এয়ার ভাইস মার্শাল পদে উন্নীত করা হয়। মহান স্বাধীনতা যুদ্ধে অসামান্য কৃতিত্বের জন্য তাঁকে ‘‘বীর উত্তম’’ খেতাব প্রদান করা হয়। ১ সেপ্টেমবর, ১৯৭৬ ঢাকা বিমান বন্দরে এক বিমান দুর্ঘটনায় তিনি ইন্তেকাল করেন।");

        List<String> p14 = new ArrayList<String>();
        p14.add("শঙ্কর গোবিন্দ চৌধুরী এলাকার কৃতি সন্তানদের মধ্যে অন্যতম।তিনি ১৯২৮ খ্রিষ্টাব্দের অক্টোবরে নাটোর শহরের অদূরে ছাতনী গ্রামে সম্ভ্রান্ত চৌধুরী পরিবারে জন্মগ্রহণ করেন। তিনি ১৯৭০এবং ১৯৮১ সালে এম.পি নির্বাচিত হন।এছাড়াও ৩ বার পৌরসভার চেয়ারম্যান ছিলেন, ১৯৭৫ সালে গভর্ণর নির্বাচিত হন।জনকল্যাণমূলক কাজে তিনি তাঁর ব্যক্তিগত সময় ও সম্পদ অকৃপণে ব্যয় করেছেন।\n" +
                "\n" +
                "সমাজসেবায় তাঁর অবদান সর্বজনবিদিত ও অনস্বীকার্য। তিনি নাটোরের সফল রাজনীতিবিদদের মধ্যে অন্যতম। ১৩ সেপ্টম্বর, ১৯৯৫ তারিখে তিনি মৃত্যুবরণ করেন। তাঁকে স্মরণীয় করতে তাঁর সম্মানে ‘শঙ্কর গোবিন্দ চৌধুরী স্টেডিয়াম’টি প্রতিষ্ঠা করা হয়।");

        List<String> p15 = new ArrayList<String>();
        p15.add("সমর পাল ১৯৫২ খ্রিস্টাব্দের ৩১ ডিসেম্বর নাটোর শহরের পালপাড়ায় জন্মগ্রহণ করেন। শৈশব থেকেই অত্যন্ত মেধাবী সমর পাল ১৯৭৬ খ্রিস্টাব্দে কৃতিত্বের সাথে স্নাতকোত্তর ডিগ্রি অর্জন করেন। সরকারি চাকুরির সৌজন্যে ঘুরে বেড়িয়েছেন দেশের প্রত্যন্ত অঞ্চল। ইতিহাস-সাহিত্য-সংস্কৃতির সাথে তাঁর রয়েছে নাড়ির টান। যেখানেই গিয়েছেন ইতিহাস-সংস্কৃতির শেকড় সন্ধান করেছেন।\n" +
                "\n" +
                "কর্মজীবন শুরু করেন ১৯৭৭ খ্রিস্টাব্দে তৎকালীন শিক্ষা মন্ত্রণালয়ের বিজ্ঞান ও প্রযুক্তিবিদ্যা বিভাগে ফেলো হিসেবে। ১৯৮১ খ্রিস্টাব্দে সহকারী কমিশনার হিসেবে প্রশাসনে যোগদান করেন এবং পরবর্তীতে সরকারের বিভিন্ন উচ্চ পদে আসীন ছিলেন। বর্তমানে তিনি অবসর জীবন যাপন করছেন।\n" +
                "\n" +
                "ইতিহাস ও সাহিত্য কর্মে অবদানের জন্য ১৯৯৫ সালে পশ্চিম বঙ্গের শিলিগুড়িতে দার্জিলিং জেলা গ্রন্থমেলা কর্তৃক সংবর্ধিত হন। ২০০০ সালে রংপুর জেলা থেকে ইতিহাস গ্রন্থে অবদানের জন্য স্মারক সম্মান লাভ করেন। ২০০৬ খ্রিঃ এ ময়মনসিংহ লোকসাহিত্য ও সংস্কৃতি কেন্দ্র থেকে ইতিহাস গবেষণার জন্য সংবর্ধনা ও সম্মাননা লাভ করেন।");

        List<String> p16 = new ArrayList<String>();
        p16.add("বঙ্গবন্ধুর ঘনিষ্ঠ সহচর মুক্তিযুদ্ধের অন্যতম সংগঠক বর্ণাঢ্য রাজনৈতিক জীবনের অধিকারী আশরাফুল ইসলাম জন্মে ছিলেন তৎকালীন রাজশাহী জেলার নাটোর মহকুমার সিংড়া থানার অন্তর্গত চলনবিল অধ্যুষিত তাজপুর গ্রামে ১৯২৩ সালের ১৯ শে ফেব্রুয়ারী। পিতা - ঘাসিউল্লা, মাতা- আজজান বিবি। আশরাফুল ইসলামের দেশ জুড়া রাজনৈতিক পরিচিত ছিল। তাকে চলনবিলের নয়ন মণি বলা হত। তিনি ছিলেন সিংড়া থানার আওয়ামীলীগ এর প্রতিষ্ঠাতা সভাপতি। ১৯৪৪-১৯৫০ সময়ে ৩নং ইটালী ইউনিয়ন বোর্ড়ের নির্বাচিত প্রেসিডেন্ট ছিলেন। তিনি নাটোর মহকুমা আওয়ামীলীগ এর অন্যতম প্রতিষ্ঠাতা সদস্য।\n" +
                "\n" +
                " \n" +
                "\n" +
                "আশরাফুল ইসলাম ১৯৭০ সালে আওয়ামীলীগ এর মনোনয়নে তৎকালীন প্রাদেশিক পরিষদে এবং ১৯৭৩ সলে জাতীয় সংসদ সদস্য নির্বাচিত হন। ১৯৭১ সালে মুক্তিযুদ্ধ চলাকালীন মুজির নগর প্রশাসনে জোনাল এড মিনিষ্ট্রেটিভ কাউন্সিলের (পশ্চিম জোন-২) চেয়ারম্যান ছিলেন। তিনি ১৯৬৬-১৯৭১ সময়ে বৃহত্তর রাজশাহী জেলা আওয়ামীলীগ এর সাধারণ সম্পাদক ছিলেন। ১৯৭২-১৯৭৫ সাল পর্যন্ত নাটোর জেলা আওয়ামীলীগ এর সভাপতি ছিলেন। আইয়ুব বিরোধী আন্দোলনে তিনি কারা বরণ করেন।");

        List<String> p17 = new ArrayList<String>();
        p17.add("জাকির তালুকদারের জন্ম নাটোরে, ২০ জানুয়ারি ১৯৬৫। চিকিৎসা বিজ্ঞানে স্নাতক। পরবর্তীতে উচ্চতর শিক্ষা স্বাস্থ্য অর্থনীতিতে। বিভিন্ন বেসরকারি প্রতিষ্ঠানের চিকিৎসা ও গবেষণা বিভাগে কাজ করছেন। বর্তমানে নতুন প্রজন্মের কথা সাহিত্যিক হিসেবে ইতোমধ্যে পাঠক-হৃদয়ে ও বোদ্ধামহলে স্থান করে নিয়েছেন।\n" +
                "\n" +
                "এক সময় প্রগতিশীল ছাত্র রাজনীতিতে সরাসরি জড়িত জাকির তালুকদার বরাবর সাম্রাজ্যবাদ বিরোধী সাংস্কৃতিক ও সামাজিক আন্দোলনে যুক্ত থাকায় তাঁর গদ্যে সমাজ বাস্তবতার সঙ্গে রাজনীতি ও ইতিহাসচেতনা এসেছে ভিন্ন মাত্রা নিয়ে। কথা সাহিত্যে বিশেষ অবদানের স্বীকৃতি স্বরুপ ২০০১ সালে লাভ করেছেন ‘কাগজ কথাসাহিত্য পুরস্কার’।\n" +
                "\n" +
                "পূর্বে উল্লেখিত ব্যক্তিবর্গ ছাড়াও নাটোরের কৃতি সন্তানদের মধ্যে রয়েছেন কালী প্রসন্ন রায় রামকান্ত রায়,রাণী হেমাঙ্গিনী দেবী,মোহিত কুমার মৈত্র,প্রমথ নাথ বিশী,গজেন্দ্রনাথ কর্মকার।");


        List<String> p18 = new ArrayList<String>();
        p18.add("১৯৩০ সালের ১ মে নাটোর জেলার সদর উপজেলার হাটবিলা গ্রামে শফীউদ্দীন সরদারের জন্ম। ১৯৫০ সালে তিনি ম্যাট্রিক পাস করেন। রাজশাহী সরকারি কলেজ থেকে ১৯৫৫ সালে বি.এ (অনার্স) পাস করেন। পরবর্তীতে বি.এড, এম.এড এবং এম.এ (ইতিহাস) পুনরায়\n" +
                "\n" +
                "ইংরেজীতে এম.এ পাশ করেন এবং লন্ডন বিশ্ববিদ্যালয় থেকে ডিপ্লোমা-ইন-এডুকেশন ডিগ্রি লাভ করেন।\n" +
                "\n" +
                "তিনি কর্মজীবনে প্রধান শিক্ষক, অধ্যাপক, অধ্যক্ষ হিসেবে কর্মরত ছিলেন। ১৯৮২ সালে সরকারের প্রশাসনে ম্যাজিস্ট্রেট হিসেবে যোগ দিলেও পরবর্তীতে তা ছেড়ে দেন।\n" +
                "\n" +
                "তিনি শখের বশবর্তী হয়ে মঞ্চাভিনেতা, বেতারের নাট্যকার, নাট্যশিল্প ও নাটক পরিচালনা করেন। জীবনের সন্ধিক্ষণে তিনি সার্বক্ষণিক নিজেকে লেখার কাজে নিয়োজিত রেখেছেন। বিশেষতঃ ইতিহাস কেন্দ্রিক তাঁর লেখা উপন্যাসগুলো পাঠক হৃদয়ে স্থান করে নিয়েছে। সাহিত্যের সৃজন পথে তিনি এগিয়ে চলেছেন দীপ্তলয়ে। তাঁর প্রকাশিত বইয়ের সংখ্যা প্রায় ৫০টির ওপরে।");


        expandableListDetail.put("হযরত ঘাসী দেওয়ান", p1);
        expandableListDetail.put("কুবীর চান শাহ্", p2);
        expandableListDetail.put("দেওয়ান সাগর", p3);
        expandableListDetail.put("মহারাজা জগদিন্দ্রনাথ রায়", p4);
        expandableListDetail.put("মহারানী ভবানী", p5);
        expandableListDetail.put("মরমী কবি আহসান আলী", p6);
        expandableListDetail.put("স্যার যদুনাথ সরকার", p7);
        expandableListDetail.put("শরৎকুমার রায়", p8);
        expandableListDetail.put("হাসার উদ্দীন কবিরত্ন", p9);
        expandableListDetail.put("মাদার বখশ", p10);
        expandableListDetail.put("মোঃ মকসুদুর রহমান", p11);
        expandableListDetail.put("রাধাচরণ চক্রবর্তী", p12);
        expandableListDetail.put("এয়ার ভাইস মার্শাল খাদেমুল বাসার", p13);
        expandableListDetail.put("শঙ্কর গোবিন্দ চৌধুরী", p14);
        expandableListDetail.put("সমর পাল", p15);
        expandableListDetail.put("আশরাফুল ইসলাম প্রাক্তন এম. পি", p16);
        expandableListDetail.put("জাকির তালুকদার", p17);
        expandableListDetail.put("শফীউদ্দীন সরদার", p18);


        return expandableListDetail;
    }
}
